In [4]:
age = [35,66,77,99,15] 
print(age[3])
print(age[0])
print(age[1])
print(age[3])

99
35
66
99

In [5]:
import pandas as pd
df=pd.DataFrame(age,columns=['age'])

ModuleNotFoundError: No module named 'pandas'

In [ ]:
df

   age
0   35
1   66
2   77
3   99
4   15

In [ ]:
print(age)

[35, 66, 77, 99, 15]

In [ ]:
df['Name'] = ['Yen','Amorn','kate','Ning','Ami'] #add column in dataframe
df

   age   Name
0   35    Yen
1   66  Amorn
2   77   kate
3   99   Ning
4   15    Ami

In [ ]:
temp1 = df [['age','Name']] #accessing mutiple columns
temp1

   age   Name
0   35    Yen
1   66  Amorn
2   77   kate
3   99   Ning
4   15    Ami

In [ ]:
first_row = df.iloc[0] #accessing row by index
print(first_row)

age      35
Name    Yen
Name: 0, dtype: object

In [ ]:
df['Surname'] = ['Yen1','Amorn1','kate1','Ning1','Ami1']
df

   age   Name Surname
0   35    Yen    Yen1
1   66  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   15    Ami    Ami1

In [ ]:
temp2 = df [['Name','Surname']] #accessing mutiple columns
temp2

    Name Surname
0    Yen    Yen1
1  Amorn  Amorn1
2   kate   kate1
3   Ning   Ning1
4    Ami    Ami1

In [ ]:
result = df.loc[0,'Surname'] #accessing row by index
result

'Yen1'

In [ ]:
df.rename(columns={'age':'Age'}, inplace=True)

In [ ]:
df

   Age   Name Surname
0   35    Yen    Yen1
1   66  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   15    Ami    Ami1

In [ ]:
df.loc[1,'Age'] = 9 
df

   Age   Name Surname
0   35    Yen    Yen1
1    9  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   15    Ami    Ami1

In [ ]:
df.drop(index=4,inplace=True)
df

   Age   Name Surname
0   35    Yen    Yen1
1    9  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1

In [ ]:
new_row = pd.DataFrame({'Age': [45], 'Name': ['Frame'], 'Surname': ['pppp']})
df = pd.concat([df, new_row], ignore_index=True)

In [ ]:
df

   Age   Name Surname
0   35    Yen    Yen1
1    9  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   45  Frame    pppp

In [ ]:
df = pd.concat([df, new_row], ignore_index=True)

In [ ]:
df

   Age   Name Surname
0   35    Yen    Yen1
1    9  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   45  Frame    pppp
5   45  Frame    pppp

In [ ]:
df.drop(index=5,inplace=True)
df

   Age   Name Surname
0   35    Yen    Yen1
1    9  Amorn  Amorn1
2   77   kate   kate1
3   99   Ning   Ning1
4   45  Frame    pppp

In [ ]:
df.drop(columns=['Surname'], inplace=True)
df

   Age   Name
0   35    Yen
1    9  Amorn
2   77   kate
3   99   Ning
4   45  Frame

In [ ]:
df.to_csv('data.csv',index=False)

In [8]:
df = pd.read_csv('data.csv')
df

ModuleNotFoundError: No module named 'pandas'